{"title": "Kung Pao Chicken Zoodles", "image": "https://www.skinnytaste.com/wp-content/uploads/2014/08/Kung-Pao-Chicken-Zoodles-170x255.jpg ", "cook_time": "15 minutes", "servings": "2", "calories_per_serving": "277", "ingredients": ["2 medium zucchini", "  1 tsp  canola oil", " 6 oz skinless chicken breasts (cut into 1/2-inch pieces)", " 1/2 red bell pepper (cut into 1/2-inch pieces)", " 2 cloves garlic (minced)", " 1 tsp ginger (minced)", " 1 tsp sesame oil", " 2 tbsp crushed peanuts", " 2 tbsp scallions", " 1 ½ tbsp. soy sauce", " 1 tbsp balsamic vinegar", " 1 tsp hoisin", " 2 ½ tbsp water", " ½ tsp chili paste", " 2 tsp sugar", " 2 tsp cornstarch"], "directions": "Using a spiralizer with the thickest noodle blade, cut the zucchini into long spaghetti-like strips. Use kitchen scissors to cut the strands into pieces that are about 6 to 8 inches long. /p In a small bowl, whisk together soy sauce, balsamic, hoisin, water, red chili paste, sugar and cornstarch; set aside. /p Season chicken with salt and pepper, to taste. Heat oil in a large, deep nonstick pan or wok over medium-high heat. Add the chicken and cook until browned and cooked through, about 4 to 5 minutes. Set aside. /p Reduce heat to medium, add sesame oil, garlic and ginger to the skillet and cook until fragrant, about  30 seconds.  /p Add the bell pepper, stir in soy sauce mixture and bring to a boil; reduce heat and simmer until thickened and bubbling, about 1-2 minutes. /p Stir in zucchini noodles and cook, mixing for about two minutes until just tender and mixed with the sauce. If it seems dry, don't worry the zucchini will release moisture which helps create a sauce.  /p Once cooked, mix in chicken and divide between 2 bowls (about 2 cups each) and top with peanuts and scallions. /p Serving Size: ½ of total yield /p Calories 277", "references": [{"name": "Skinny Taste", "link": " https://www.skinnytaste.com/kung-pao-chicken-zoodles-for-two/"}], "tags": ["Dinner", " Chicken", " Zoodles", " Asian", " Under 350 Calories"]}