{"title": "Zoodles, Crispy Prosciutto, and Roasted Cauliflower with Lemon Parmesan Sauce", "image": "https://inspiralized.com/wp-content/uploads/2014/10/IMG_3792-copy-682x1024.jpg ", "cook_time": "35 minutes", "servings": "35 minutes", "calories_per_serving": "257", "ingredients": ["2 cups cauliflower florets", " 2 tbsp olive oil", " ¼ tsp garlic powder", " 2 cloves garlic", " 1 large shallot", " 4 pieces prosciutto", " 1 pinch red pepper flakes", " 2 medium zucchini", " 1 tbsp parsley (garnish)", " ¼ tsp lemon zest", " 1.5 tsp lemon juice", " ¼ cup plain Greek yogurt", " 1.5 tbsp grated parmesan", " salt and pepper to taste"], "directions": "Preheat oven to 450. Line a baking tray with parchment paper and set aside. /p Toss cauliflower with 1 tbsp olive oil, garlic powder, salt, and pepper. Lay on prepared baking tray and roast for 20 minutes until easily pierced with a fork and lightly browned. /p While cauliflower is roasting, combine all ingredients for the lemon dressing (lemon zest and juice, Greek Yogurt, grated parmesan, salt and pepper) and set aside. /p Mince the garlic and shallot. Spiralize the zucchini (blade C on a spiralizer) and trim noodles. /p Place a large skillet over medium heat and coat with cooking spray. Lay in the prosciutto slices and cook for 3-5 minutes or until crispy. Transfer to a paper towel lined plate and set aside. /p Allow the skillet to cool before adding remaining 1 tbsp olive oil and heating over medium heat. Add garlic, shallots, and red pepper flakes. Cook 30 seconds or until fragrant, and then add zucchini noodles. Cook 3-5 minutes. /p Add in cauliflower and crumble prosciutto over the skillet. Give a toss, then remove from the heat and stir in the Lemon Dressing. Toss to combine and divide into bowls. Sprinkle with parsley to garnish. /p Serving Size: ½ of total yield /p Calories 257", "references": [{"name": "Inspiralized", "link": "  https://inspiralized.com/zucchini-spaghetti-crispy-prosciutto-and-roasted-cauliflower-with-lemon-parmesan-sauce/"}], "tags": ["Dinner", " Zoodles", " Under 250 Calories"]}